#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Находит пользователя и если его нет, то создает нового пользователя.
// 
// Параметры:
//  ПользовательИБ - ПользовательИнформационнойБазы
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - Найденная или созданная ссылка 
Функция НайтиИЛИСоздатьПользователя(ПользовательИБ) Экспорт
	
	ПользовательСсылка = НайтиПоНаименованию(ПользовательИБ.Имя);
	
	Если ЗначениеЗаполнено(ПользовательСсылка)  Тогда
		Возврат ПользовательСсылка;
	КонецЕсли;
	
	ПользовательОбъект = СоздатьЭлемент();
	ПользовательОбъект.Наименование = ПользовательИБ.Имя;
	ПользовательОбъект.ПолноеИмя	= ПользовательИБ.ПолноеИмя;
	
	ПользовательОбъект.ЗаполнитьНаборПрав(ПользовательИБ);
	ПользовательОбъект.Записать();
	
	Возврат ПользовательОбъект.Ссылка;
КонецФункции

#КонецЕсли